#Инструкция
#Демонстрирует, как создавать собственные функции
def instructions():
    """Выводит на экран инструкцию для игрока."""
    print(
        """
        Добро пожаловать на ринг грандизнейших интеллектуальных состязаний всех времен.
        Твой мозг и мой прцессор сойдутся в схватке за доской игры "Крестики ноилики".
        Чтобы сделать ход, введи чесло от 0 до 8. Числа однозначно соответствуют полям доски - так, как показано ниже
         0 | 1 | 2 
        ----------
         3 | 4 | 5 
        ----------
         6 | 7 | 8 
         Приготовься к бою. \n"""
    )
    #Основная часть
    print("Это инструкция для игры в 'крестики ноилики':")
    instructions()